import os
import sys

# 允许前导零存在，那我们就计算每一个状态码的可能表达的数字个数，之后全部相乘

mp = {
    0: '1111110', 
    1: '0110000',
    2: '1101101',
    3: '1111001',
    4: '0110011',
    5: '1011011',
    6: '1011111',
    7: '1110000',
    8: '1111111',
    9: '1111011'
}

'''
是不是只要关注状态码中的1的位置，看看有几个和当前状态码1的位置吻合的个数

那我就先遍历一遍当前的状态码，把所有1的下标找出来，去和mp中的状态码对比，只要有一个对不上，不相等就是错的

'''
ans = 1
for i in range(18):
    cnt = 0
    s = input()

    # 先获取所有的s中1的位置，加入到一个list
    pos = []
    for p in range(len(s)):
        if s[p] == '1':
            pos.append(p)

    # 遍历所有的正确状态码
    for _ in range(0, 9 + 1):
        c_s = mp[_]
        for j in pos:
            if c_s[j] != '1':
                break
        else:
            cnt += 1
    ans *= cnt

print(ans)










